# GetAlignmentMethod Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelStick..::..GetAlignmentMethod Method
AnalyticalModelStick Class See Also
---
Gets the alignment method for a given selector.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public AnalyticalAlignmentMethod GetAlignmentMethod(
	AnalyticalElementSelector selector
)
```

Visual Basic
---
```text
Public Function GetAlignmentMethod ( _
	selector As AnalyticalElementSelector _
) As AnalyticalAlignmentMethod
```

Visual C++
---
```text
public:
AnalyticalAlignmentMethod GetAlignmentMethod(
	AnalyticalElementSelector selector
)
```

# ### Parameters
selector
    Type: Autodesk.Revit.DB.Structure..::..AnalyticalElementSelector End of the analytical model.
# ### Return Value
The alignment method at a given end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModelStick Class
Autodesk.Revit.DB.Structure Namespace